tutorials/channelFlow/dat/openfoam/navierNonEqSlipPoiseuille/template/template/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    topWall
    {
        type            zeroGradient;
    }

    bottomWall 
    {
        type            zeroGradient;
    }

    inFlow
    {
        type            fixedValue;
        value           uniform 0;
    }

    outFlow
    {
        type            fixedValue;
        value           uniform !@pRight@!;
    }

    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
